public class Main {
    public static void main(String[] args) {
        int ticket = 15_554; //стоимость билета
        int miles = (ticket / 20); // количество начисленных миль

        System.out.println("Количество начисленных балов = " + miles);


        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}